/*	ÎÄ¼şÃû£ºiniInterrupt.h
	¹¦ÄÜ£ºÉùÃ÷ÖĞ¶Ï¹¦ÄÜ£¨Ö÷ÒªÎªÎÂ¶È²É¼¯ºÍ¹âÇ¿¶È²É¼¯£©
	×÷Õß£ºÀ×Á¦
	Ê±¼ä£º
	ĞèÒª×¢ÒâµÄÎÊÌâ£º
*/


/*******************************ÎÄ¼şĞŞ¸Ä¼ÇÂ¼(S)***********************************/
/*1.
/*ĞŞ¸ÄÇ°:
/*ĞŞ¸ÄÎª:
/*ÈÕÆÚ£
/*ĞŞ¸ÄÕß: 
/********************************ÎÄ¼şĞŞ¸Ä¼ÇÂ¼(E)**********************************/
#if !defined _INI_INTERRUPT_
#define _INI_INTERRUPT_

#include "stc12c5axxxx.h"
#define CYCLE 10

void ini_Interrupt(); //³õÊ¼»¯ÖĞ¶Ï

void LED1602_Flash();

void ini_Timer0();

void ini_Timer1();

#endif