
/*	ÎÄ¼şÃû£ºiniLED.c
	¹¦ÄÜ£ºÊµÏÖÒº¾§12864µÄÏà¹Øº¯Êı¹¦ÄÜ£¨Ö÷Òª°üÀ¨³õÊ¼»¯ºÍÏÔÊ¾£©
	×÷Õß£ºÀ×Á¦
	´´½¨ÈÕÆÚ£º2011-01-10
	×÷³ÉÈÕÆÚ£º2011-01-17
	ĞèÒª×¢ÒâµÄÎÊÌâ£º LED12864_Transfer_Data()Êı¾İ¿ÚµÄÉèÖÃ,LED1602_Write(),LED1602_Enable()
*/


/*******************************ÎÄ¼şĞŞ¸Ä¼ÇÂ¼(S)***********************************/
/*1.
/*ĞŞ¸ÄÇ°:
/*ĞŞ¸ÄÎª:
/*ÈÕÆÚ£
/*ĞŞ¸ÄÕß:
/********************************ÎÄ¼şĞŞ¸Ä¼ÇÂ¼(E)**********************************/
#include "iniLED.h"
#include "myDefine.h"


/********************************************************************
* Ãû³Æ : ini_LED()
* ¹¦ÄÜ : ³õÊ¼»¯Òº¾§
* ÊäÈë : ÎŞ
* Êä³ö : ÎŞ
***********************************************************************/
void ini_LED()
{
	//LED12864_Ini_Char_Lib();
	//LED12864_Ini_Graphic_Lib();
	LED1602_Ini();
}

//ÒÔÏÂÊÇ12864Ïà¹Øº¯Êı

/********************************************************************
* Ãû³Æ : LED12864_Ini_Char_Lib()
* ¹¦ÄÜ : ³õÊ¼»¯×Ö·û¿â
* ÊäÈë : ÎŞ
* Êä³ö : ÎŞ
***********************************************************************/
/*
void LED12864_Ini_Char_Lib()
{
	delay_1ms(40);             //´óÓÚ40MSµÄÑÓÊ±³ÌĞò
	PSB = 1;                 //ÉèÖÃÎª8BIT²¢¿Ú¹¤×÷Ä£Ê½
	delay_1ms(1);              //ÑÓÊ±
	RES = 0;                 //¸´Î»
	delay_1ms(1);              //ÑÓÊ±
	RES = 1;                 //¸´Î»ÖÃ¸ß
	delay_1ms(10);
	LED12864_Transfer_Data(0x30,0);  //Extended Function Set :8BITÉèÖÃ,RE=0: basic instruction set, G=0 :graphic display OFF
	DelayXus(100);            //´óÓÚ100uSµÄÑÓÊ±³ÌĞò
	LED12864_Transfer_Data(0x30,0);  //Function Set
	DelayXus(37);             ////´óÓÚ37uSµÄÑÓÊ±³ÌĞò
	LED12864_Transfer_Data(0x08,0);  //Display on Control
	DelayXus(100);            //´óÓÚ100uSµÄÑÓÊ±³ÌĞò
	LED12864_Transfer_Data(0x10,0);  //Cursor Display Control¹â±êÉèÖÃ
	DelayXus(100);            //´óÓÚ100uSµÄÑÓÊ±³ÌĞò
	LED12864_Transfer_Data(0x0C,0);  //Display Control,D=1,ÏÔÊ¾¿ª
	DelayXus(100);            //´óÓÚ100uSµÄÑÓÊ±³ÌĞò
	LED12864_Transfer_Data(0x01,0);  //Display Clear
	DelayXus(100);             //´óÓÚ100uSµÄÑÓÊ±³ÌĞò
	LED12864_Transfer_Data(0x06,0);  //Enry Mode Set,¹â±ê´ÓÓÒÏò×ó¼Ó1Î»ÒÆ¶¯
	DelayXus(100);            //´óÓÚ100uSµÄÑÓÊ±³ÌĞò
}

*/
/********************************************************************
* Ãû³Æ : LED12864_Ini_Graphic_Lib()
* ¹¦ÄÜ : ³õÊ¼»¯Í¼ĞÎ¿â
* ÊäÈë : ÎŞ
* Êä³ö : ÎŞ
***********************************************************************/
/*
void LED12864_Ini_Graphic_Lib()
{
	delay_1ms(40);             //´óÓÚ40MSµÄÑÓÊ±³ÌĞò
	PSB=1;                 //ÉèÖÃÎª8BIT²¢¿Ú¹¤×÷Ä£Ê½
	delay_1ms(1);              //ÑÓÊ±
	RES=0;                 //¸´Î»
	delay_1ms(1);              //ÑÓÊ±
	RES=1;                 //¸´Î»ÖÃ¸ß
	DelayXus(10);	
	LED12864_Transfer_Data(0x36,0);  //Extended Function Set RE=1: extended instruction
	DelayXus(100);            //´óÓÚ100uSµÄÑÓÊ±³ÌĞò
	LED12864_Transfer_Data(0x36,0);  //Extended Function Set:RE=1: extended instruction set
	DelayXus(37);             ////´óÓÚ37uSµÄÑÓÊ±³ÌĞò
	LED12864_Transfer_Data(0x3E,0);  //EXFUNCTION(DL=8BITS,RE=1,G=1)
	DelayXus(100);            //´óÓÚ100uSµÄÑÓÊ±³ÌĞò
	LED12864_Transfer_Data(0x01,0);  //CLEAR SCREEN
    DelayXus(100);            //´óÓÚ100uSµÄÑÓÊ±³ÌĞò
}
*/
/********************************************************************
* Ãû³Æ : LED12864_Transfer_Data()
* ¹¦ÄÜ : ÏÔÊ¾×Ö·û
* ÊäÈë : data1£ºÏòLED12864´«ËÍµÄÊı¾İ»òÃüÁî
* Êä³ö : ÎŞ
***********************************************************************/
/*
void LED12864_Transfer_Data(char data1,bit DI)  //´«ËÍÊı¾İ»òÕßÃüÁî,µ±DI=0ÊÇ,´«ËÍÃüÁî,µ±DI=1,´«ËÍÊı¾İ.
{
	//¹ØÓÚÑÓ³ÙÊÀ¼ä£¬ĞèÒª×ĞÏ¸ÔÄ¶ÁÊ±Ğò×ÊÁÏ
	WRD=0;  //ÏòLEDĞ´
	RS=DI;	//Ö¸Áî»òÊı¾İ
	DelayXus(1);
    P0=data1;                          //P0Îª12864Óëµ¥Æ¬»úµÄÊı¾İ½Ó¿Ú
	E=1;
	DelayXus(1);
	E=0;
 }
*/

/********************************************************************
* Ãû³Æ : LED12864_Display_Char()
* ¹¦ÄÜ : ÏÔÊ¾×Ö·û
* ÊäÈë : address£º×Ö·ûÊı×éÊ×µØÖ·
* Êä³ö : ÎŞ
***********************************************************************/
/*
void LED12864_Display_Char(uchar code *address)
{
	uchar i;
	LED12864_Transfer_Data(0x80,0);  //Set Graphic Display RAM Address
	DelayXus(100);
	for(i=0;i<32;i++)
	{
		LED12864_Transfer_Data(*address,1);
		address++;
	}
	
	LED12864_Transfer_Data(0x90,0);  //Set Graphic Display RAM Address
	DelayXus(100);
	for(i=32;i<64;i++)
	{
		LED12864_Transfer_Data(*address,1);
		address++;
	}
}
*/
/********************************************************************
* Ãû³Æ : LED12864_Display_Graphic()
* ¹¦ÄÜ : ÏÔÊ¾×Ö·û
* ÊäÈë : address£º×Ö·ûÊı×éÊ×µØÖ·
* Êä³ö : ÎŞ
***********************************************************************/
/*
void LED12864_Display_Graphic(uchar code *address)
{

   int i,j;
//*******ÏÔÊ¾ÉÏ°ëÆÁÄÚÈİÉèÖÃ
   for(i=0;i<32;i++)              //
    { 
      LED12864_Transfer_Data((0x80 + i),0); //SET  ´¹Ö±µØÖ· VERTICAL ADD
      LED12864_Transfer_Data(0x80,0);       //SET  Ë®Æ½µØÖ· HORIZONTAL ADD
      for(j=0;j<16;j++)
       {
        LED12864_Transfer_Data(*address,1);
         address++;
       }
    }	   
//*******ÏÔÊ¾ÏÂ°ëÆÁÄÚÈİÉèÖÃ
   for(i=0;i<32;i++)              //
    {
      LED12864_Transfer_Data((0x80 + i),0); //SET ´¹Ö±µØÖ· VERTICAL ADD
      LED12864_Transfer_Data(0x88,0);       //SET Ë®Æ½µØÖ· HORIZONTAL ADD
      for(j=0;j<16;j++)
       {
         LED12864_Transfer_Data(*address,1);
         address++;
       }
    }
}*/

//ÒÔÏÂÊÇ1602Ïà¹Øº¯Êı
/********************************************************************
* Ãû³Æ : LED1602_Convert(uchar In_Date)
* ¹¦ÄÜ : ÒòÎªµçÂ·Éè¼ÆÊ±£¬P0.0--P0.7½Ó·¨¸ÕºÃÁË×ÊÁÏÖĞµÄÏà·´£¬ËùÒÔÉè¼Æ¸Ãº¯Êı¡£
* ÊäÈë : 1602×ÊÁÏÉÏµÄÖµ
* Êä³ö : ËÍµ½1602µÄÖµ
***********************************************************************/
/*uchar LED1602_Convert(uchar In_Date)
{
    uchar i, Out_Date = 0, temp = 0;
    for(i=0; i<8; i++)
    {
        temp = (In_Date >> i) & 0x01;
        Out_Date |= (temp << (7 - i));
    }
    return Out_Date;
}*/

/********************************************************************
* Ãû³Æ : LED1602_Enable(uchar del)
* ¹¦ÄÜ : 1602ÃüÁîº¯Êı
* ÊäÈë : ÊäÈëµÄÃüÁîÖµ
* Êä³ö : ÎŞ
***********************************************************************/

void LED1602_Enable(uchar del)
{
	//LED_DATA = LED1602_Convert(del);
	LED_DATA = del;
	RS = 0;
	RW = 0;
	E = 0;
	DelayXus(1);
	E = 1;
	DelayXus(1);
}

/********************************************************************
* Ãû³Æ : uchar LED1602_read()
* ¹¦ÄÜ : 1602¶ÁÊı¾İº¯Êı
* ÊäÈë : ÎŞ
* Êä³ö : ÎŞ
***********************************************************************/
/*uchar LED1602_Read()
{
	uchar r;
	RS = 1;
	RW = 1;
	E = 1;
	r = P0;
	return r;
}*/


/********************************************************************
* Ãû³Æ : LED1602_Write(uchar del)
* ¹¦ÄÜ : 1602Ğ´Êı¾İº¯Êı
* ÊäÈë : ĞèÒªĞ´Èë1602µÄÊı¾İ
* Êä³ö : ÎŞ
***********************************************************************/
void LED1602_Write(uchar del)
{
//	LED_DATA = LED1602_Convert(del);
	LED_DATA = del;
	RS = 1;
	RW = 0;
	E = 0;
	DelayXus(1);
	E = 1;
	DelayXus(1);
}

/********************************************************************
* Ãû³Æ : LED1602_Ini(void)
* ¹¦ÄÜ : 1602³õÊ¼»¯£¬Çë²Î¿¼1602µÄ×ÊÁÏ
* ÊäÈë : ÎŞ
* Êä³ö : ÎŞ
***********************************************************************/
void LED1602_Ini(void)
{
	LED1602_Enable(0x01);
	LED1602_Enable(0x38);
	LED1602_Enable(0x0c);
	LED1602_Enable(0x06);
	LED1602_Enable(0xd0);
}

/********************************************************************
* Ãû³Æ : L1602_char(uchar hang,uchar lie,char sign)
* ¹¦ÄÜ : ¸Ä±äÒº¾§ÖĞÄ³Î»µÄÖµ£¬Èç¹ûÒªÈÃµÚÒ»ĞĞ£¬µÚÎå¸ö×Ö·ûÏÔÊ¾"b" £¬µ÷ÓÃ¸Ãº¯ÊıÈçÏÂ
		 L1602_char(1,5,'b')
* ÊäÈë : ĞĞ£¬ÁĞ£¬ĞèÒªÊäÈë1602µÄÊı¾İ
* Êä³ö : ÎŞ
***********************************************************************/
void LED1602_Char(uchar hang,uchar lie,char sign)
{
	uchar a;
	if(hang == 1) a = 0x80;
	if(hang == 2) a = 0xc0;
	a = a + lie - 1;
	LED1602_Enable(a);
	LED1602_Write(sign);
}

/********************************************************************
* Ãû³Æ : L1602_String(uchar hang,uchar lie,uchar *p)
* ¹¦ÄÜ : ¸Ä±äÒº¾§ÖĞÄ³Î»µÄÖµ£¬Èç¹ûÒªÈÃµÚÒ»ĞĞ£¬µÚÎå¸ö×Ö·û¿ªÊ¼ÏÔÊ¾"ab cd ef" £¬µ÷ÓÃ¸Ãº¯ÊıÈçÏÂ
	 	 L1602_String(1,5,"ab cd ef;")
* ÊäÈë : ĞĞ£¬ÁĞ£¬ĞèÒªÊäÈë1602µÄÊı¾İ
* Êä³ö : ÎŞ
***********************************************************************/
void LED1602_String(uchar hang,uchar lie,uchar *p)
{
	uchar a;
	if(hang == 1) a = 0x80;
	if(hang == 2) a = 0xc0;
	a = a + lie - 1;
	LED1602_Enable(a);
	while(1)
	{
		if(*p == '\0') break;
		LED1602_Write(*p);
		p++;
	}
}



